{
  "backend/main.mo": "Main actor implementing eligibility checks, community profile management with supporterOfCommunity flag, mentor browsing, and photo upload using authorization and storage mixins.",
  "backend/migration.mo": "Migration module converting old CommunityProfile records to the new format by adding supporterOfCommunity with default false.",
  "feature_evidence.json": "Feature evidence report mapping supporterOfCommunity-related frontend changes to corresponding files, components, and requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing routing, pages, hooks, components, and supporterOfCommunity feature additions.",
  "frontend/index.css": "Global Tailwind-based style definitions including light/dark butterfly-themed OKLCH color palette and base resets.",
  "frontend/index.html": "HTML entry point loading the React app with metadata and butterfly-themed favicon.",
  "frontend/src/App.tsx": "Main router setup defining public and authenticated routes wrapped in AppShell with authentication and eligibility gating.",
  "frontend/src/backendExtensions.d.ts": "TypeScript module augmenting backend interface with future post, comment, and report types and endpoints.",
  "frontend/src/components/auth/AgeGate.tsx": "Age verification page requiring 18+ confirmation and triggering eligibility confirmation via backend.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing authenticated navigation, themed background, main content area, and footer.",
  "frontend/src/components/nav/AuthedNav.tsx": "Authenticated navigation bar with links, admin-specific items, and logout handling.",
  "frontend/src/components/profile/ProfilePhotosManager.tsx": "Manages avatar and profile photo uploads, previews, validation, removal, and progress tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity auth to expose login state and a logout function that clears cached queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for storing, loading, and managing Internet Identity authentication.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for eligibility, profiles, directory browsing, contacts, and reporting using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables for the UI palette.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/Connections.tsx": "Placeholder page displaying a UI card for future connection management features.",
  "frontend/src/pages/Directory.tsx": "Mentor directory page with filters for mentoring, mentorship, and community supporters, fetching and displaying profiles.",
  "frontend/src/pages/Feed.tsx": "Community feed placeholder showing upcoming posting features and disabled post creation UI.",
  "frontend/src/pages/Guidelines.tsx": "Static community guidelines page outlining rules for respect, safety, community building, and reporting.",
  "frontend/src/pages/Landing.tsx": "Public landing page with hero section, login CTA, and feature overview for the platform.",
  "frontend/src/pages/Moderation.tsx": "Moderation panel that checks admin status and displays either an access denial or placeholder moderation tools.",
  "frontend/src/pages/PostDetail.tsx": "Placeholder page for viewing a post and its comments until backend integration is complete.",
  "frontend/src/pages/ProfileMe.tsx": "User profile setup and editing page that loads, edits, validates, and saves community profile data.",
  "frontend/src/pages/ProfileView.tsx": "Renders a user profile page, loads profile data, displays avatar and details, and allows sending connection requests.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, and plugins.",
  "project_state.json": "Project metadata describing features, requirements, and current state of the Butterfly Connections platform."
}