{
  "backend/main.mo": "Main backend actor defining community profiles, messaging, reporting, moderation, eligibility, and authorization using mixins and various maps for state.",
  "backend/migration.mo": "Migration module adding new moderation fields and returning updated actor state with banned users and reports.",
  "feature_evidence.json": "Feature evidence definitions mapping feature IDs to associated frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their purpose across routing, hooks, components, and pages.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining the light and dark themed butterfly color palette and base styles.",
  "frontend/index.html": "HTML entry point setting up meta tags, app title, favicon, and mounting the main React script.",
  "frontend/src/App.tsx": "Top-level React router setup implementing routing, authentication, eligibility gating, and AppShell-wrapped authenticated views.",
  "frontend/src/backendExtensions.d.ts": "TypeScript module augmentation defining future backend types and methods for posts, comments, and moderator management.",
  "frontend/src/components/auth/AgeGate.tsx": "Displays an age verification screen, handling confirmation and submitting eligibility status with optional logout.",
  "frontend/src/components/auth/BannedScreen.tsx": "Shows a banned account message with optional reason and provides a sign‑out button.",
  "frontend/src/components/helloCorner/HelloCornerComposer.tsx": "Lets users compose Hello Corner posts with text, optional photo/video uploads, previews, and submission handling.",
  "frontend/src/components/helloCorner/HelloCornerMessageItem.tsx": "Renders a single Hello Corner message with author info, media attachments, and reaction controls.",
  "frontend/src/components/helloCorner/HelloCornerMessageList.tsx": "Lists Hello Corner messages with loading, empty, error, and pagination states.",
  "frontend/src/components/helloCorner/HelloCornerReactions.tsx": "Manages like/dislike reactions for a message, updating counts and user selection.",
  "frontend/src/components/helloCorner/HelloCornerSection.tsx": "Combines composer and message list to provide the full Hello Corner posting and browsing section.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the app with navigation, footer, and ban‑status handling including a loading and banned view.",
  "frontend/src/components/moderation/ReportsSection.tsx": "Displays a list of reports, handles loading/error states, formats report labels, and allows moderators to resolve reports.",
  "frontend/src/components/moderation/RoleManagementSection.tsx": "Placeholder UI for upcoming moderator role management, showing an admin-only notice.",
  "frontend/src/components/moderation/UserActionsSection.tsx": "Provides tools to validate principals, check ban status, and ban or unban users with reasons.",
  "frontend/src/components/nav/AuthedNav.tsx": "Navigation bar for authenticated users with conditional moderator link and logout handling.",
  "frontend/src/components/profile/ProfilePhotosManager.tsx": "Manages avatar and profile photo selection, previews, validation, and removal with upload progress tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor based on identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity auth, exposing login/logout and principal info while clearing cached queries on logout.",
  "frontend/src/hooks/useHelloCorner.ts": "React-query hooks for listing, creating, and reacting to Hello Corner messages, with automatic cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing identity loading, login flow, and status flags.",
  "frontend/src/hooks/useModeration.ts": "Adds React Query hooks for moderator actions including roles, reports, and user bans using the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for eligibility checks, profiles, mentor directory, contacts, and content reporting via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme color variables and base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Connections.tsx": "UI page showing a placeholder for user connections with styled cards and icons.",
  "frontend/src/pages/Directory.tsx": "Community directory page with filter controls and mentor profile listings fetched via useBrowseMentors.",
  "frontend/src/pages/Feed.tsx": "Feed page rendering a community header and HelloCornerSection content.",
  "frontend/src/pages/Guidelines.tsx": "Displays community guidelines using styled cards outlining behavior, safety, community values, and reporting rules.",
  "frontend/src/pages/Landing.tsx": "Renders the public landing page with hero content, community features, and a login call-to-action.",
  "frontend/src/pages/Moderation.tsx": "Provides a permission-gated moderation dashboard with tabs for reports, user actions, and admin-only role management.",
  "frontend/src/pages/PostDetail.tsx": "Placeholder page showing post details and comments until backend integration is complete.",
  "frontend/src/pages/ProfileMe.tsx": "Allows the logged-in user to view and edit their profile, including name, bio, tags, mentoring settings, and photos.",
  "frontend/src/pages/ProfileView.tsx": "Shows another user's profile with avatar, bio, and an option to send a connection request.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store/retrieve them in sessionStorage, and manage persisted or sensitive params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, container settings, animations, and using typography, container-query, and animation plugins.",
  "project_state.json": "Holds the project's versioned state, summary, and a list of defined features with requirement IDs and metadata."
}