{
  "backend/main.mo": "Main actor implementing profiles, eligibility checks, photo uploads, and authorization using storage and access‑control mixins.",
  "backend/migration.mo": "Migration module converting old CommunityProfile records to the new format by adding the profilePhoto field.",
  "feature_evidence.json": "Feature evidence report mapping profile‑photo‑related features to frontend files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file involved in routing, UI, and profile photo management.",
  "frontend/index.css": "Global Tailwind and OKLCH theme definitions providing light/dark butterfly‑themed styling tokens.",
  "frontend/index.html": "HTML entry point loading the React app and defining metadata and favicon.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication and eligibility gating, and wraps authenticated routes in AppShell.",
  "frontend/src/backendExtensions.d.ts": "Extends backend TypeScript types with future post, comment, and report interfaces for the frontend.",
  "frontend/src/components/auth/AgeGate.tsx": "Age‑verification screen requiring users to confirm 18+ status before accessing community features.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing navigation, main content container, and a styled footer with dynamic year and external link.",
  "frontend/src/components/nav/AuthedNav.tsx": "Authenticated navigation bar with links, admin-only moderation link, and logout handling.",
  "frontend/src/components/profile/ProfilePhotosManager.tsx": "Manages avatar and profile photo upload, preview, validation, removal, and progress tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity auth, exposing login state, principal, and a logout method that clears cached queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for loading, logging in, and maintaining Internet Identity authentication state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for eligibility, profiles, directory browsing, contacts, and reporting actions using the backend actor.",
  "frontend/src/index.css": "Tailwind setup with custom OKLCH design tokens for light and dark themes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/Connections.tsx": "Static placeholder page describing upcoming connections management features.",
  "frontend/src/pages/Directory.tsx": "Displays a searchable mentor directory with filtering and profile cards based on query results.",
  "frontend/src/pages/Feed.tsx": "Shows a placeholder community feed and a disabled post creation feature pending backend support.",
  "frontend/src/pages/Guidelines.tsx": "Presents community guidelines in several themed cards outlining rules and expectations.",
  "frontend/src/pages/Landing.tsx": "Landing page with branding, introduction, feature highlights, and a login CTA.",
  "frontend/src/pages/Moderation.tsx": "Checks admin status and shows either an access-denied message or a placeholder moderation panel.",
  "frontend/src/pages/PostDetail.tsx": "Placeholder page indicating post details and comments will be added once backend is ready.",
  "frontend/src/pages/ProfileMe.tsx": "User profile editor that loads, displays, and updates community profile data with form controls.",
  "frontend/src/pages/ProfileView.tsx": "Renders a user profile page with avatar, profile details, optional photos, and a connect button using query hooks for profile data and contact actions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and clean parameters from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and enabled plugins for the frontend.",
  "project_state.json": "Contains the project’s high-level state, feature list, and metadata for the Butterfly Connections platform."
}