{
  "backend/main.mo": "Motoko actor implementing eligibility confirmation, community profiles, mentorship browsing, and basic contact handling with access control mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to code files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind base styles defining a light/dark butterfly‑themed color palette and CSS variables.",
  "frontend/index.html": "HTML entry point setting metadata, root mount point, and loading the main React script.",
  "frontend/src/App.tsx": "Main React router setup with public routes, authenticated routes wrapped in AppShell, and auth/eligibility gating logic.",
  "frontend/src/backendExtensions.d.ts": "TypeScript module augmentation adding post, comment, and report types plus future backend method signatures.",
  "frontend/src/components/auth/AgeGate.tsx": "Age‑verification component requiring 18+ confirmation and triggering eligibility storage via backend mutation.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with navigation, content container, and themed footer.",
  "frontend/src/components/nav/AuthedNav.tsx": "Renders the authenticated navigation bar with links, admin check, and logout handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity authentication, exposing identity, login, logout, and login status helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing identity loading, login, logout, and status state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend operations like eligibility, profiles, mentors, contacts, and reporting.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for light and dark theme color palettes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/Connections.tsx": "Displays a placeholder UI for managing user connections with a card-based layout.",
  "frontend/src/pages/Directory.tsx": "Implements a directory with mentorship filters and a mentor listing fetched via React Query.",
  "frontend/src/pages/Feed.tsx": "Displays a placeholder community feed with a disabled post creation button and informational text.",
  "frontend/src/pages/Guidelines.tsx": "Shows community guidelines across several themed cards covering respect, safety, community building, and reporting.",
  "frontend/src/pages/Landing.tsx": "Landing page with hero section, login CTA, and feature highlights introducing the platform.",
  "frontend/src/pages/Moderation.tsx": "Checks admin permissions and displays either an access denied message or a placeholder moderation panel.",
  "frontend/src/pages/PostDetail.tsx": "Placeholder page indicating that post details and comments will appear once backend integration is complete.",
  "frontend/src/pages/ProfileMe.tsx": "Provides profile setup and editing functionality, loading user data and allowing updates via a form.",
  "frontend/src/pages/ProfileView.tsx": "Displays another user's profile with option to send a connection request and handles loading and missing-profile states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and remove them from hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending typography, container queries, animations, colors, and theme settings.",
  "project_state.json": "Stores project metadata including versioning, feature list, issues, and required image assets."
}