{
  "backend/main.mo": "Main actor implementing connection-gated forum threads, replies, and thread listing with access control and basic in‑memory state.",
  "backend/migration.mo": "Defines old and new actor data models and a migration function that initializes empty new‑format state.",
  "feature_evidence.json": "Feature evidence report linking implemented features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind CSS styles defining light and dark butterfly‑themed OKLCH color palettes.",
  "frontend/index.html": "HTML entry point setting up metadata, title, favicon, and mounting the React application.",
  "frontend/src/App.tsx": "React router configuration defining public and authenticated routes including connections thread detail pages.",
  "frontend/src/backendExtensions.d.ts": "TypeScript module augmentations adding future post, comment, and moderation APIs to the backend interface.",
  "frontend/src/components/auth/AgeGate.tsx": "Renders an age verification screen allowing users to confirm they are 18+, triggering an eligibility mutation and offering a logout option.",
  "frontend/src/components/auth/BannedScreen.tsx": "Displays an account ban message with optional reason and provides a sign‑out button that redirects to the home page.",
  "frontend/src/components/connections/ConnectionsThreadList.tsx": "Shows a list of connection threads with loading, empty, and error states, linking each thread to its detail page and supporting pagination.",
  "frontend/src/components/connections/NewThreadComposer.tsx": "Provides a dialog-based form for creating new threads, validating input and submitting via a createThread mutation.",
  "frontend/src/components/connections/RepliesList.tsx": "Displays replies for a thread with loading, empty, and error states, showing author info and content for each reply.",
  "frontend/src/components/connections/ReplyComposer.tsx": "Offers a reply form for a thread, validating content and submitting replies through a mutation.",
  "frontend/src/components/helloCorner/HelloCornerComposer.tsx": "Enables composing Hello Corner posts with text, photo, or video attachments, handling validation, previews, upload progress, and submission.",
  "frontend/src/components/helloCorner/HelloCornerMessageItem.tsx": "Renders a single Hello Corner message with avatar, content, media attachments, and like/dislike reactions. Handles fetching and updating reaction state via hooks.",
  "frontend/src/components/helloCorner/HelloCornerMessageList.tsx": "Displays a list of messages with loading, error, empty-state handling, and a load‑more button. Maps each message to a HelloCornerMessageItem.",
  "frontend/src/components/helloCorner/HelloCornerReactions.tsx": "Provides like/dislike buttons with local reaction state and async handlers. Updates UI based on pending state and selected reaction.",
  "frontend/src/components/helloCorner/HelloCornerSection.tsx": "Top-level Hello Corner section that displays the composer and paginated message list. Handles message creation and pagination offset.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps authenticated app content, showing a loading screen or banned screen as needed. Provides main layout, nav bar, and footer.",
  "frontend/src/components/moderation/ReportsSection.tsx": "Lists moderation reports with loading and error states and allows resolving individual reports. Displays report details including type and reason.",
  "frontend/src/components/moderation/RoleManagementSection.tsx": "Placeholder admin-only section indicating future moderator role management. Shows basic static UI only.",
  "frontend/src/components/moderation/UserActionsSection.tsx": "Allows admins to validate principals, view ban status, and ban or unban users. Includes inputs, validation, and calls to moderation hooks.",
  "frontend/src/components/nav/AuthedNav.tsx": "Navigation bar for authenticated users with links, moderation visibility, and logout handling.",
  "frontend/src/components/profile/ProfilePhotosManager.tsx": "Manages avatar and profile photo selection, preview, validation, upload progress, and removal.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity login/logout and exposes authentication state and principal info.",
  "frontend/src/hooks/useConnectionsForum.ts": "Provides thread and reply queries and mutations for the Connections forum using the backend actor.",
  "frontend/src/hooks/useHelloCorner.ts": "Stubbed hooks for a Hello Corner feature returning placeholders and errors since backend is missing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, managing identity loading, login, logout, and related state.",
  "frontend/src/hooks/useModeration.ts": "Provides React Query hooks for moderation actions, all implemented as stubs returning defaults or throwing errors due to missing backend support.",
  "frontend/src/hooks/useQueries.ts": "Contains stubbed React Query hooks for eligibility, profiles, mentor browsing, and contacts, mostly returning defaults or throwing errors.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom light/dark theme color variables using OKLCH values.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/Connections.tsx": "Displays a paginated list of connection threads with a composer for creating new threads.",
  "frontend/src/pages/ConnectionsThreadDetail.tsx": "Shows a single thread’s details and replies, with loading/error states and a reply composer.",
  "frontend/src/pages/Directory.tsx": "Renders the community directory page with a placeholder message for unavailable features.",
  "frontend/src/pages/Feed.tsx": "Displays the community feed page with a placeholder indicating the feature is unavailable.",
  "frontend/src/pages/Guidelines.tsx": "Shows community guidelines using styled cards outlining rules and expectations.",
  "frontend/src/pages/Landing.tsx": "Landing page with hero section, features overview, and login CTA using useAuth.",
  "frontend/src/pages/Moderation.tsx": "Moderation page displaying permissions-based access and placeholder moderation tools.",
  "frontend/src/pages/PostDetail.tsx": "Placeholder page for viewing a single post, showing temporarily unavailable message.",
  "frontend/src/pages/ProfileMe.tsx": "User profile management page with placeholder content indicating features are unavailable.",
  "frontend/src/pages/ProfileView.tsx": "Public profile view page showing placeholder content for viewing another user's profile.",
  "frontend/src/utils/connectionsForumErrors.ts": "Normalizes forum-related errors into user-friendly messages based on error text.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, fonts, animations, and plugins.",
  "project_state.json": "Project metadata file describing features, requirements, and current application state."
}