{
  "kind": "build_request",
  "title": "Turn My Connections into a forum-style threaded board",
  "projectName": "Butterfly Connections",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-36",
      "text": "Replace the current placeholder “My Connections” page with a forum-board experience that supports browsing thread-style posts created within the Connections area.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "can you make the My connections like a fourm board where there is a thread like posting"
        ]
      },
      "acceptanceCriteria": [
        "Visiting /connections no longer shows the “coming soon” placeholder card.",
        "The Connections page shows a thread list UI (thread title/preview, author, created time, and reply count at minimum).",
        "The page includes an obvious action to create a new thread (e.g., “New thread”).",
        "All user-facing UI text is in English."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Implement backend storage and APIs for a Connections forum board with threads and replies, where only authenticated, eligible, non-banned users can create content and read content.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "can you make the My connections like a fourm board where there is a thread like posting"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes query/update methods to: create a connection-thread, list connection-threads (with pagination), get a single thread by id, create a reply within a thread, and list replies for a thread.",
        "All Connections forum methods enforce the same access gating used elsewhere: caller must be a permitted #user and must not be banned (returning clear trap errors when blocked).",
        "Thread IDs and reply IDs are stable and can be used by the frontend to retrieve specific threads/replies."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Limit visibility of Connections forum board content to the user’s connection network: only the thread author and the author’s accepted connections can view and reply to that author’s threads.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "make the My connections like a fourm board where there is a thread like posting"
        ]
      },
      "acceptanceCriteria": [
        "When listing threads, the caller only receives threads authored by (a) the caller or (b) principals present in the caller’s contacts list (connections).",
        "When fetching a thread or listing its replies, the backend rejects access unless the caller is allowed to view that thread under the same rule.",
        "When creating a reply, the backend rejects the action unless the caller is allowed to view/reply to that thread under the same rule."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Add React Query hooks for Connections forum threads and replies, and wire them into the Connections page so thread creation and replying update the UI without a full page reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "thread like posting"
        ]
      },
      "acceptanceCriteria": [
        "Frontend has React Query query + mutation hooks to list threads, create thread, fetch thread details, list replies, and create reply.",
        "After creating a thread, the thread list updates to include the new thread.",
        "After creating a reply, the reply list updates and the reply count displayed in the thread list (if shown) is consistent after refresh/invalidation.",
        "No edits are made to immutable paths listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Add a thread detail view accessible from the Connections thread list, showing the original thread post and a reply thread beneath it, with a reply composer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "where there is a thread like posting"
        ]
      },
      "acceptanceCriteria": [
        "From /connections, selecting a thread opens a dedicated thread view (either via a new route or an in-page panel) that displays the thread content and its replies.",
        "The thread detail view includes a reply composer that posts a reply and clears on success.",
        "Empty states exist for: no threads available, and no replies yet.",
        "Unauthorized/forbidden errors from the backend are handled with a readable English message in the UI (not a raw stack trace)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui (read-only Shadcn components); compose them instead.",
    "Do not edit frontend immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not implement Progressive Web App (PWA) / “phone app” installability in this change.",
    "Do not replace or redesign the existing global Feed/Hello Corner features as part of this request.",
    "Do not implement full Reddit-like features such as upvotes/downvotes, sub-boards/categories, search, or moderation tooling specifically for Connections threads unless explicitly requested later."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}