{
  "kind": "build_request",
  "title": "Add banning, moderator appointments, and a dedicated moderation dashboard",
  "projectName": "Butterfly Connections",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-31",
      "text": "Implement user banning in the backend so admins/moderators can ban and unban specific principals, and banned users are prevented from accessing and participating in community features.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I'd like to add banning users, appointing other moderators, or a dedicated moderation dashboard please"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes admin/moderator-only methods to ban and unban a user identified by Principal.",
        "Backend exposes a method to check whether a given Principal is currently banned (and/or returns ban status as part of a caller status endpoint).",
        "All existing user actions that require authenticated user access (e.g., eligibility confirmation, profile updates, browsing, posting Hello Corner messages, reacting, reporting) reject requests from banned users with a clear error/trap message.",
        "Banned users cannot access moderation actions unless they are the owner/admin and you explicitly decide to allow owner access; document and implement a single consistent rule.",
        "Ban state persists across canister upgrades (use stable state; add/adjust backend/migration.mo only if required by current stable layout)."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Add moderator role management in the backend so the owner/admin can appoint and remove additional moderators, and the app can distinguish at least: regular user, moderator, and admin/owner.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I'd like to add banning users, appointing other moderators, or a dedicated moderation dashboard please"
        ]
      },
      "acceptanceCriteria": [
        "Backend supports granting and revoking moderator privileges for a target Principal using an admin-only API.",
        "Backend provides queries to (a) return the caller’s role and (b) list current moderators (admin-only).",
        "Existing authorization checks are updated so moderation capabilities (e.g., reviewing reports/removing content, bans) are available to moderators as well as admins, while role-management (appoint/remove moderators) remains admin-only.",
        "Role state persists across canister upgrades (use stable state; add/adjust backend/migration.mo only if required by current stable layout)."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Build a dedicated Moderation Dashboard UI that is accessible to moderators and admins, and includes sections for (1) reviewing reports and taking action and (2) user moderation actions including banning/unbanning; include a separate admin-only section for appointing/removing moderators.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I'd like to add banning users, appointing other moderators, or a dedicated moderation dashboard please"
        ]
      },
      "acceptanceCriteria": [
        "The existing Moderation page is upgraded from the placeholder state to a functional dashboard layout with clear sections (e.g., tabs or stacked cards) for Reports, User Actions (ban/unban), and Role Management (admin-only).",
        "The dashboard is visible/accessible to moderators as well as admins (do not restrict it to only `useIsCallerAdmin()` as it is today).",
        "If a non-moderator/non-admin visits the moderation route, show an English ‘Access Denied’ message similar to the existing pattern.",
        "All new user-facing strings on the moderation dashboard are in English."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Wire the moderation dashboard to backend APIs using React Query hooks (queries + mutations) for listing reports (if available), removing content, banning/unbanning users, and appointing/removing moderators, keeping frontend-backend types type-safe.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I'd like to add banning users, appointing other moderators, or a dedicated moderation dashboard please"
        ]
      },
      "acceptanceCriteria": [
        "Frontend has React Query hooks for: checking caller role/permissions, listing moderators (admin-only), banning/unbanning a Principal, and granting/revoking moderator role (admin-only).",
        "Frontend updates the nav and route gating so the Moderation link appears for moderators and admins (not only admins).",
        "Frontend displays success/error states for moderation actions (ban/unban, role changes, content removal) and refreshes relevant queries after mutations.",
        "TypeScript types used by the React app reflect the new backend role/ban endpoints (extend the generated backend types via the existing `frontend/src/backendExtensions.d.ts` approach as needed)."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Add a clear banned-user UX so that when a banned user signs in they are shown an explicit English message that their account is banned and they cannot access community features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I'd like to add banning users, appointing other moderators, or a dedicated moderation dashboard please"
        ]
      },
      "acceptanceCriteria": [
        "When a banned user attempts to use the app after authentication, the UI shows a dedicated ‘You are banned’ message and blocks access to protected community pages/actions.",
        "The UI does not get stuck on spinners; it handles backend ‘banned’ errors gracefully and predictably.",
        "The banned message is shown consistently (e.g., in the main protected shell or via a dedicated route) and does not leak moderation controls."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture: all Motoko logic must live in backend/main.mo.",
    "Only add/update backend/migration.mo if needed to preserve existing stable state during upgrade (conditional migration policy).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose existing UI components instead).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Implementing an appeals workflow or automated ban expiry (timeouts) unless explicitly requested later.",
    "Building real-time moderation updates (no WebSockets).",
    "Automated content scanning/AI moderation.",
    "Email/SMS notifications about bans or moderator changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}