{
  "kind": "build_request",
  "title": "Add profile photo uploads and expanded profile customization",
  "projectName": "Butterfly Connections",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Extend community profiles to support user-uploaded profile photos (in addition to the existing avatar field), including storing and retrieving the uploaded image blobs as part of each user’s profile.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can you make it to where people can add photos and customize their profile"
        ]
      },
      "acceptanceCriteria": [
        "Community profile data model supports at least: (a) a primary avatar image and (b) zero or more additional uploaded profile photos.",
        "Uploaded profile photos are stored using the existing blob storage capability (Storage.ExternalBlob) and can be returned when fetching a profile.",
        "Fetching a profile (getCommunityProfile) returns references for avatar and additional photos (when present) for the requested user."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Preserve existing production profile data when introducing new profile photo fields by implementing a conditional canister state migration (only if there is existing stable state) that upgrades stored profiles without data loss.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can you make it to where people can add photos and customize their profile"
        ]
      },
      "acceptanceCriteria": [
        "After upgrade, previously saved profile fields (display name, pronouns, bio, tags, mentorship flags, and any existing avatar reference) remain intact.",
        "New photo fields default safely (e.g., empty list / null) for existing profiles.",
        "Migration is implemented following the project’s conditional migration policy (backend/migration.mo only when needed)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add UI on the “My Profile” page to let users upload and manage their profile photos: set/replace avatar photo, add additional photos, preview photos, and remove photos, then persist changes to the backend profile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can you make it to where people can add photos and customize their profile"
        ]
      },
      "acceptanceCriteria": [
        "ProfileMe provides controls to (a) upload/set an avatar photo and (b) add one or more additional profile photos.",
        "Users can see a preview of the current avatar and any uploaded additional photos on ProfileMe.",
        "Users can remove an additional profile photo from their profile (with clear confirmation or an undo-safe interaction).",
        "Saving the profile persists the avatar and additional photos such that reloading the page shows the same images."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Render user-uploaded avatar/profile photos on the “View Profile” page (and any other existing profile displays) so that other users see the customized profile visuals instead of always seeing the default avatar image.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can you make it to where people can add photos and customize their profile"
        ]
      },
      "acceptanceCriteria": [
        "ProfileView shows the user’s uploaded avatar when present; otherwise it falls back to the existing default avatar asset.",
        "If the user has additional profile photos, ProfileView displays them in a simple gallery layout (responsive, accessible).",
        "Existing profile text fields continue to render as before (no regressions)."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture: keep all Motoko logic in backend/main.mo (use backend/migration.mo only when required by conditional migration policy).",
    "Do not edit frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui). Compose existing UI components instead."
  ],
  "nonGoals": [
    "Do not add new social feed/photo posting features beyond profile photos.",
    "Do not add third-party image hosting or any external database/storage integration.",
    "Do not change authentication provider(s) (Internet Identity only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}