{
  "kind": "build_request",
  "title": "Add “Supporter of the community” selectable profile/directory flag",
  "projectName": "Butterfly Connections",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Add a new boolean field to community profiles named “supporterOfCommunity” and persist it alongside the existing mentorship flags so that users can save and retrieve this selection with their profile.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Where it states Seeking mentorship  open to mentoring can you place a selection that states supporter of the community"
        ]
      },
      "acceptanceCriteria": [
        "Backend CommunityProfile data includes a new boolean field for supporterOfCommunity.",
        "updateCommunityProfile persists supporterOfCommunity for the caller.",
        "getCommunityProfile returns supporterOfCommunity for the requested user.",
        "Existing profiles that predate this field default supporterOfCommunity to false when read after upgrade (via migration or safe defaulting)."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Extend the directory browsing API so the directory can be filtered by “Supporter of the community” in addition to “Open to mentoring” and “Seeking mentorship”.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Where it states Seeking mentorship  open to mentoring can you place a selection that states supporter of the community"
        ]
      },
      "acceptanceCriteria": [
        "The backend directory browsing method accepts a filter input that includes supporterOfCommunity.",
        "When the supporterOfCommunity filter is enabled, returned profiles include users with supporterOfCommunity = true (combined with existing mentoring/mentorship filter behavior).",
        "If all filters are disabled, the API returns an empty list (current behavior pattern), or the frontend prevents requesting with all filters off (either approach is acceptable as long as UX is consistent)."
      ]
    },
    {
      "id": "REQ-18",
      "text": "On the “My Profile” page, add a new selection control in the Mentorship section labeled “Supporter of the community”, alongside “Open to mentoring others” and “Seeking mentorship”, and ensure it is saved/loaded with the profile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Where it states Seeking mentorship  open to mentoring can you place a selection that states supporter of the community"
        ]
      },
      "acceptanceCriteria": [
        "The ProfileMe edit form shows a third toggle/switch labeled exactly “Supporter of the community” in the same section as the other mentorship toggles.",
        "When a user toggles “Supporter of the community” and saves, the value persists and is restored on reload.",
        "In ProfileMe view mode, the Mentorship summary area includes “✓ Supporter of the community” when the flag is enabled."
      ]
    },
    {
      "id": "REQ-19",
      "text": "On the Directory page, add a filter toggle labeled “Supporter of the community” alongside the existing mentorship filters, and display the supporter status on profile cards when enabled on a profile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Where it states Seeking mentorship  open to mentoring can you place a selection that states supporter of the community"
        ]
      },
      "acceptanceCriteria": [
        "Directory filter UI includes a third switch labeled exactly “Supporter of the community”.",
        "Directory queries include the supporterOfCommunity filter value when calling the browse API.",
        "Directory result cards visually indicate supporter status (e.g., a small label similar to the existing “Mentoring” / “Seeking” indicators) when supporterOfCommunity is true."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not add email-based authentication or require email for membership (Internet Identity remains the only supported login method).",
    "Do not introduce third-party auth providers or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}