{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Butterfly Connections – Connections Forum Board (Frontend)",
  "requirements": [
    {
      "id": "REQ-36",
      "summary": "Replace the placeholder Connections page with a forum-style thread list and a clear “New thread” creation action.",
      "acceptanceCriteria": [
        "Visiting /connections no longer shows the “coming soon” placeholder card.",
        "The Connections page shows a thread list UI (thread title/preview, author, created time, and reply count at minimum).",
        "The page includes an obvious action to create a new thread (e.g., “New thread”).",
        "All user-facing UI text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Connections.tsx",
          "operation": "modify",
          "description": "Replace the placeholder UI with a forum-board layout: header + thread list (title, preview, author display, created time, reply count) plus an obvious “New thread” action. Use existing shadcn/ui components by composition (do not edit frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/connections/ConnectionsThreadList.tsx",
          "operation": "create",
          "description": "Add a reusable thread list component for /connections that renders loading/empty/error states and a list of thread rows/cards with title/preview/author/time/reply count. Use shadcn/ui components by composition (e.g., Card, Button, Skeleton). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/connections/NewThreadComposer.tsx",
          "operation": "create",
          "description": "Add a thread composer (modal or inline) that collects title and content, validates required fields, and triggers thread creation. Use shadcn/ui components by composition (e.g., Dialog, Input, Textarea, Button). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Add React Query hooks for listing/creating threads and replies, and wire them into the Connections UI so updates occur without full reload.",
      "acceptanceCriteria": [
        "Frontend has React Query query + mutation hooks to list threads, create thread, fetch thread details, list replies, and create reply.",
        "After creating a thread, the thread list updates to include the new thread.",
        "After creating a reply, the reply list updates and the reply count displayed in the thread list (if shown) is consistent after refresh/invalidation.",
        "No edits are made to immutable paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useConnectionsForum.ts",
          "operation": "create",
          "description": "Create React Query hooks backed by the actor methods in frontend/src/backend.d.ts: listThreads (with offset/limit), createThread, getThread, getThreadReplies, and replyToThread. Ensure queries are disabled until the actor is available (follow the pattern used in existing hooks). On mutations, invalidate the relevant caches so lists/details update without reload."
        },
        {
          "path": "frontend/src/pages/Connections.tsx",
          "operation": "modify",
          "description": "Wire the new hooks into the Connections page: fetch and render threads via React Query; trigger createThread via mutation; invalidate and refresh the list after success; surface readable English error messages for authorization/forbidden traps (avoid raw stack traces). Also ensure UI stays consistent with auth gating provided by the selected authorization system (Internet Identity + actor lifecycle); verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/connections/ConnectionsThreadList.tsx",
          "operation": "modify",
          "description": "Integrate hook results (loading, error, data) and support pagination UI (e.g., “Load more”) using offset/limit. If displaying reply counts, ensure they reflect refreshed data after mutations (via invalidation)."
        },
        {
          "path": "frontend/src/utils/connectionsForumErrors.ts",
          "operation": "create",
          "description": "Add a small utility to normalize backend trap/authorization errors into readable English messages (e.g., unauthorized/forbidden/network issues) for reuse in Connections list and thread detail views."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Add a thread detail view reachable from /connections that shows the original post, replies, and a reply composer with proper empty/error states.",
      "acceptanceCriteria": [
        "From /connections, selecting a thread opens a dedicated thread view (either via a new route or an in-page panel) that displays the thread content and its replies.",
        "The thread detail view includes a reply composer that posts a reply and clears on success.",
        "Empty states exist for: no threads available, and no replies yet.",
        "Unauthorized/forbidden errors from the backend are handled with a readable English message in the UI (not a raw stack trace)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ConnectionsThreadDetail.tsx",
          "operation": "create",
          "description": "Create a dedicated thread detail page that loads a thread (title/content/author/time) and its replies, shows an empty state when no replies exist, and includes a reply composer that clears on success. Use React Query hooks from useConnectionsForum and readable error messaging from the Connections forum error utility. Use shadcn/ui components by composition (Card, Button, Textarea, Separator, etc.). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/connections/ReplyComposer.tsx",
          "operation": "create",
          "description": "Add a reply composer component used by the thread detail page to submit a reply via mutation, disable while submitting, and clear input on success. Use shadcn/ui components by composition. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/connections/RepliesList.tsx",
          "operation": "create",
          "description": "Add a replies list component used by the thread detail page that renders loading/empty/error states and displays replies with author and created time."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new authenticated route for the thread detail view (e.g., /connections/$threadId) wrapped in AppShell, and ensure navigation from the Connections thread list links to it."
        },
        {
          "path": "frontend/src/pages/Connections.tsx",
          "operation": "modify",
          "description": "Update thread list items to navigate to the new thread detail route when selected (using TanStack Router Link), ensuring the detail view is reachable from /connections."
        }
      ]
    }
  ]
}