{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add “Supporter of the community” profile flag + directory filter (frontend)",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Add “Supporter of the community” toggle to My Profile Mentorship section and save/load it with the community profile.",
      "acceptanceCriteria": [
        "The ProfileMe edit form shows a third toggle/switch labeled exactly “Supporter of the community” in the same section as the other mentorship toggles.",
        "When a user toggles “Supporter of the community” and saves, the value persists and is restored on reload.",
        "In ProfileMe view mode, the Mentorship summary area includes “✓ Supporter of the community” when the flag is enabled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfileMe.tsx",
          "operation": "modify",
          "description": "Extend local form state to include supporterOfCommunity, initialize it from the loaded profile, include it in the CommunityProfile object passed to updateCommunityProfile, add a new Switch+Label control in the Mentorship edit section labeled exactly “Supporter of the community”, and update view-mode mentorship summary rendering to include “✓ Supporter of the community” when true (and ensure the Mentorship block renders when any of the three flags is enabled)."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add “Supporter of the community” directory filter toggle and show supporter status on directory profile cards.",
      "acceptanceCriteria": [
        "Directory filter UI includes a third switch labeled exactly “Supporter of the community”.",
        "Directory queries include the supporterOfCommunity filter value when calling the browse API.",
        "Directory result cards visually indicate supporter status (e.g., a small label similar to the existing “Mentoring” / “Seeking” indicators) when supporterOfCommunity is true."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useBrowseMentors to accept a filters object that includes supporterOfCommunity, and forward that full filters object to browseMentors; also add a guard so if all three filters are false, the query does not fetch and instead returns an empty list (keeping UX consistent with the existing empty-state UI)."
        },
        {
          "path": "frontend/src/pages/Directory.tsx",
          "operation": "modify",
          "description": "Add a third filter Switch+Label labeled exactly “Supporter of the community”, include supporterOfCommunity in the filters passed to useBrowseMentors, and add a third small status indicator on each result card (styled consistently with existing “Mentoring” / “Seeking” indicators) when profile.supporterOfCommunity is true."
        }
      ]
    }
  ]
}